# Handling Misiing value.

# Deleting all Non Value:
# Syntax:
          # var.dropna(inplace=True)
# Creating non value:
# Syntax:
          # np.non

df = pd.DataFrame

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'name':['Suraj','Anuj','Ankit','Ashvik','Suyash',np.nan],
                 'roll_no':[np.nan,11,12,np.nan,14,16],
                 'marks':[58,44,np.nan,98,33,55]})
df

     name  roll_no  marks
0   Suraj      NaN   58.0
1    Anuj     11.0   44.0
2   Ankit     12.0    NaN
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

In [4]:
df.dropna(inplace=True)
df

     name  roll_no  marks
1    Anuj     11.0   44.0
4  Suyash     14.0   33.0

# Filling Nan Values:

# Syntax:
# var['col_name']=var['col_name'].fillna(value)

In [5]:
df = pd.DataFrame({'name':['Suraj','Anuj','Ankit','Ashvik','Suyash',np.nan],
                 'roll_no':[np.nan,11,12,np.nan,14,16],
                 'marks':[58,44,np.nan,98,33,55]})
df

     name  roll_no  marks
0   Suraj      NaN   58.0
1    Anuj     11.0   44.0
2   Ankit     12.0    NaN
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

In [6]:
df['name']=df['name'].fillna('unknown')
df

      name  roll_no  marks
0    Suraj      NaN   58.0
1     Anuj     11.0   44.0
2    Ankit     12.0    NaN
3   Ashvik      NaN   98.0
4   Suyash     14.0   33.0
5  unknown     16.0   55.0

In [7]:
m= round(df['marks'].mean())
df['marks'] = df['marks'].fillna(m).astype(int)
df

      name  roll_no  marks
0    Suraj      NaN     58
1     Anuj     11.0     44
2    Ankit     12.0     58
3   Ashvik      NaN     98
4   Suyash     14.0     33
5  unknown     16.0     55

In [8]:
df['roll_no'].mean()

np.float64(13.25)

In [9]:
round(df['roll_no'].mean())

13

In [10]:
m= round(df['roll_no'].mean())
df['roll_no'] = df['roll_no'].fillna(m).astype(int)
df

      name  roll_no  marks
0    Suraj       13     58
1     Anuj       11     44
2    Ankit       12     58
3   Ashvik       13     98
4   Suyash       14     33
5  unknown       16     55

In [11]:
m= round(df['roll_no'].mean())
df['roll_no'] = df['roll_no'].fillna(m).astype(bool)
df

      name  roll_no  marks
0    Suraj     True     58
1     Anuj     True     44
2    Ankit     True     58
3   Ashvik     True     98
4   Suyash     True     33
5  unknown     True     55

In [12]:
m= round(df['marks'].mean())
df['marks'] = df['marks'].fillna(m).astype(bool)
df

      name  roll_no  marks
0    Suraj     True   True
1     Anuj     True   True
2    Ankit     True   True
3   Ashvik     True   True
4   Suyash     True   True
5  unknown     True   True

In [13]:
df = pd.DataFrame({'name':['Suraj','Anuj','Amit','Ashvik','Suyash',np.nan],
                 'roll_no':[np.nan,11,12,np.nan,14,16],
                 'marks':[58,44,np.nan,98,33,55]})
df

     name  roll_no  marks
0   Suraj      NaN   58.0
1    Anuj     11.0   44.0
2    Amit     12.0    NaN
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

# Forward filling:

- It will fill the nan value with its previous value.

# Syntax:
- df['col_name'] = df['col_name'].ffill()

In [19]:
df['marks']=df['marks'].ffill()
df

     name  roll_no  marks
0   Suraj      NaN   44.0
1    Anuj     11.0   44.0
2    Amit     12.0   98.0
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

# Backward filling:
- It will fill the nan value with its next value.
# Syntax:
- df['col_name'] = df['col_name'].bfill()

In [18]:
df['marks']=df['marks'].bfill()
df

     name  roll_no  marks
0   Suraj      NaN   44.0
1    Anuj     11.0   44.0
2    Amit     12.0   98.0
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

In [16]:
df = pd.DataFrame({'name':['Suraj','Anuj','Amit','Ashvik','Suyash',np.nan],
                 'roll_no':[np.nan,11,12,np.nan,14,16],
                 'marks':[np.nan,44,np.nan,98,33,55]})
df

     name  roll_no  marks
0   Suraj      NaN    NaN
1    Anuj     11.0   44.0
2    Amit     12.0    NaN
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0

In [17]:
df['marks']=df['marks'].bfill().ffill()
df

     name  roll_no  marks
0   Suraj      NaN   44.0
1    Anuj     11.0   44.0
2    Amit     12.0   98.0
3  Ashvik      NaN   98.0
4  Suyash     14.0   33.0
5     NaN     16.0   55.0